"ITranslate/Portuguese To English" = "ITranslate/Português para Inglês";
"ITranslate/English To Portuguese" = "ITranslate/Inglês para Português";
"ITranslate/English To Spanish" = "ITranslate/Inglês para Espanhol";